In [1]:
# %matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [18]:
print(f'There are {titles.shape[0]} movies listed.')
print(f'There are {len(titles)} movies listed.')

There are 232330 movies listed.
There are 232330 movies listed.

### What are the earliest two films listed in the titles dataframe?

In [8]:
titles.sort_values(by='year').head()

                                                    title  year
177757                                         Miss Jerry  1894
215272                                 The Startled Lover  1898
124505     Reproduction of the Corbett and Jeffries Fight  1899
20657   Pierrot's Problem, or How to Make a Fat Wife O...  1900
13599                                Family Troubles (II)  1900

In [9]:
titles.sort_values(by='year').head()[0:2]

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [125]:
filter_ham = titles['title'].str.contains('Hamlet')
hamletmovies = titles[filter_ham]
print(f'There are {len(hamletmovies)} movies listed.')
hamletmovies.head()

There are 54 movies listed.

                                title  year
4394  Dogg's Hamlet, Cahoot's Macbeth  2005
6009                           Hamlet  1948
7670        Hamlet: Prince of Denmark  1989
8582                      Hamlet (II)  2005
8865                      Hamlet (II)  2015

### How many movies are titled "North by Northwest"?

### When was the first movie titled "Hamlet" made?

In [73]:
hamletmovies.sort_values(by='year')

                                          title  year
46721                                    Hamlet  1910
209878                                   Hamlet  1911
166410                                   Hamlet  1913
72925                        A Sagebrush Hamlet  1919
98554                                    Hamlet  1921
99398                        Han, hun og Hamlet  1922
24178                        Han, hun og Hamlet  1932
6009                                     Hamlet  1948
128388                                   Hamlet  1954
182970                                   Hamlet  1964
227105                              Hamlet (II)  1964
122704                                   Hamlet  1969
221479                                   Hamlet  1973
102506      Predstava 'Hamleta' u Mrdusi Donjoj  1974
24284               Intikam Melegi/Kadin Hamlet  1976
92146                                    Hamlet  1976
94355                                    Hamlet  1987
114431                   Hamlet liikemaailmassa  1987
7670                  Hamlet: Prince of Denmark  1989
45350                                    Hamlet  1990
192443                             H for Hamlet  1993
14317                     Green Eggs and Hamlet  1995
201291                                   Hamlet  1996
151918                              Fuck Hamlet  1996
17419                 Hamlet, Prince of Denmark  1997
94554                                    Hamlet  2000
223618                   Hamlet in the Hamptons  2002
37146                                  Hamlet_X  2003
174293                                 Hamlet X  2004
4394            Dogg's Hamlet, Cahoot's Macbeth  2005
8582                                Hamlet (II)  2005
44682                              Hamlet (III)  2007
163471                              Hamlet (II)  2007
71152   The Tragedy of Hamlet Prince of Denmark  2007
172418                Hamlet the Vampire Slayer  2008
98086                                  Hamlet 2  2008
211393                           Kitchen Hamlet  2009
176069                                   Hamlet  2009
102919                                   Hamlet  2011
167861                            Zombie Hamlet  2012
15183                            Hamlet Unbound  2012
83789                       Harry, Hamlet and I  2013
143184                            Hamlet A.D.D.  2014
223568                                   Hamlet  2014
168965                                   Hamlet  2015
195089                           Hamlet's Ghost  2015
8865                                Hamlet (II)  2015
39230                  Hamlet, Son of a Kingpin  2015
193914        Royal Shakespeare Company: Hamlet  2016
109367                            Hamlet Frezer  2016
42266                               Hamlet (IV)  2016
113096                             Hamlet (III)  2016
15202             Hamlet: The Fall of a Sparrow  2017
62549                            Redneck Hamlet  2017

In [55]:
firsthamlet = hamletmovies.sort_values(by='year')['title'].iloc[0]
print(f'The first Hamlet move was "{firsthamlet}"')

The first Hamlet move was "A Sagebrush Hamlet"

### List all of the "Treasure Island" movies from earliest to most recent.

### How many movies were made in the year 1950?

In [58]:
filter50 = titles['year'] == 1950
print(f'{len(titles[filter50])} movies were made in the year 1950')
titles[filter50]

1099 movies were made in the year 1950

                             title  year
71                Campo O' Donnell  1950
90                Botta e risposta  1950
233                         Madari  1950
552            Un certain monsieur  1950
1004             Vom Teufel gejagt  1950
...                            ...   ...
230617  Na Zha da zhan Hong Hai Er  1950
231254                Dwie brygady  1950
231404                       Jogan  1950
231936                Rasuna valea  1950
232004            Thyella sto faro  1950

[1099 rows x 2 columns]

### How many movies were made in the year 1960?

### How many movies were made from 1950 through 1959?

### In what years has a movie titled "Batman" been released?

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [59]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [95]:
filterInc = cast['title'] =='Inception'
inception = cast[filterInc]

In [96]:
inception

,title,year,name,type,character,n
94937,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
144039,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
177911,Inception,2010,Tom Berenger,actor,Browning,8.0
191432,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
251777,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3259597,Inception,2010,Ellen Page,actress,Ariadne,3.0
3313720,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3340319,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3347057,Inception,2010,Talulah Riley,actress,Blonde,25.0
3582980,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [97]:
print(inception['n'].count(), 'roles in Inception movies are not ranked as na')
print('Total roles in Inception: ',len(inception))

51 roles in Inception movies are not ranked as na
Total roles in Inception:  77

### But how many roles in the movie "Inception" did receive an "n" value?

In [98]:
print(len(inception)-inception['n'].count()," roles have na as 'n' value")

26  roles have na as 'n' value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [102]:
filterNBN = cast['title'] == "North by Northwest"
nbn = cast[filterNBN]
nbn

,title,year,name,type,character,n
12251,North by Northwest,1959,Stanley Adams,actor,Lieutenant Harding,NaN
28055,North by Northwest,1959,Andy Albin,actor,Farmer,NaN
54453,North by Northwest,1959,Don Anderson,actor,Worker,NaN
54668,North by Northwest,1959,Ernest Anderson,actor,Porter on Twentieth Century Ltd.,NaN
92793,North by Northwest,1959,Malcolm Atterbury,actor,Man at Prairie Crossing,NaN
...,...,...,...,...,...,...
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
3438039,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3459310,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3590410,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3601874,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

In [112]:
nbn['n'].dtype

dtype('float64')

In [123]:
nbnSorted = nbn.sort_values(by='n').dropna()
print(len(nbnSorted))
nbnSorted

16

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

In [124]:
#See what happens when subset parameter is given
nbnSorted2 = nbn.sort_values(by='n').dropna(subset='n')
print(len(nbnSorted))
nbnSorted2

16

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

In [134]:
filterHamletRoles = (cast['title'] == "Hamlet") & (cast['year'] == 1921)
hamletRoles = cast[filterHamletRoles]
hamletRoles

          title  year                    name     type         character    n
7488     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
444994   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
538568   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1102007  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2119366  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2303412  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2578993  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2954242  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3229662  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [133]:
print('There were ',len(hamletRoles), 'in the 1921 version of Hamlet')

There were  9 in the 1921 version of Hamlet

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

In [139]:
filterHamletChar = cast['character'].str.contains('Hamlet') # All characters with "Hamlet" in the character role

hamletCharacter = cast[filterHamletChar]
hamletCharacter

,title,year,name,type,character,n
6046,Sugar,2008,Hamlet Abreu,actor,Hamlet,58.0
19231,Hamlet: Prince of Denmark,1989,Kabir Ahamed,actor,"Hamlet, Prince of Denmark",NaN
58142,Jevreji dolaze,1992,Mladen Andrejevic,actor,Fica Hamlet,4.0
79644,Hamlet (II),2015,Brandon Arnold,actor,Hamlet Senior,NaN
94622,Top of the Town,1937,Mischa Auer,actor,Hamlet,6.0
...,...,...,...,...,...,...
3256838,Head Over Heels,2001,Jan Owen,actress,Hamlet's Owner,44.0
3277291,Hamlet,2015,Maxine Peake,actress,Hamlet,1.0
3544688,B.F.'s Daughter,1948,Ellinor Vanderveer,actress,Woman at Hamlet Play,NaN
3552896,To Be or Not to Be,1942,Dorothy Vernon,actress,Member of Audience at Performance of Hamlet,NaN
3576453,Unstable Fables: 3 Pigs & a Baby,2008,Audrey Wasilewski,actress,Hamlet,22.0

In [150]:
countHamletRoles = hamletCharacter['character'].str.strip().value_counts()
countHamletRoles

Hamlet                                         93
Member of Audience at Performance of Hamlet     3
Ghost of Hamlet's Father                        2
Man in 'Hamlet' Audience                        2
Hamlet's Father                                 2
                                               ..
Ghost of Hamlet's Father in 'Hamlet'            1
Ghost of King Hamlet                            1
The Real Hamlet                                 1
Hamlet M?ller - Actor                           1
Woman at Hamlet Play                            1
Name: character, Length: 70, dtype: int64

In [148]:
print('There have been ',countHamletRoles[0],'in all Hamlet movies through history')

There have been  93 in all Hamlet movies through history

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?